docs/site/20260129210700-electrobassoon.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-21 Sat 11:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Electrobassoon</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="../style.css" type="text/css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">Electrobassoon</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgdb88c03">Web &amp; Socials</a></li>
<li><a href="#orgea30bd7">Workflow A: Software Processing (Max/MSP)</a>
<ul>
<li><a href="#org069c0bb">Ardour Process</a></li>
</ul>
</li>
<li><a href="#org1f96909">Workflow B: Hardware Processing (Pedals)</a></li>
<li><a href="#org922e33c">Visuals: projectM Preset Development</a></li>
<li><a href="#orgd531f32">Breadcrumbs (Handover)</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgdb88c03" class="outline-2">
<h2 id="orgdb88c03">Web &amp; Socials</h2>
<div class="outline-text-2" id="text-orgdb88c03">
<ul class="org-ul">
<li>Website: <a href="https://electricbassoon.org">electricbassoon.org</a></li>
<li>Socials (YT/IG): `@electrobassoon`</li>
</ul>
</div>
</div>
<div id="outline-container-orgea30bd7" class="outline-2">
<h2 id="orgea30bd7">Workflow A: Software Processing (Max/MSP)</h2>
<div class="outline-text-2" id="text-orgea30bd7">
<ul class="org-ul">
<li><b>OS</b>: Windows</li>
<li><b>Logic</b>: Use Max/MSP for effects -&gt; Route via <b>VB Matrix</b> -&gt; Record in <b>Pure Data</b>.</li>
<li><b>Recording Specs</b>:
<ul class="org-ul">
<li>Track 1: Dry Bassoon Input</li>
<li>Track 2: Little Jake Input</li>
<li>Track 3,4: Max/MSP Wet Output</li>
</ul></li>
<li><b>Context Note</b>: Since no Max license, ensure the Pd patch is set to the correct sample rate before starting the Max runtime.</li>
<li>Next time try the Little Jake straight into the interface. It sounds a bit tubby and almost unusable.</li>
</ul>
</div>
<div id="outline-container-org069c0bb" class="outline-3">
<h3 id="org069c0bb">Ardour Process</h3>
<div class="outline-text-3" id="text-org069c0bb">
<ul class="org-ul">
<li>Reverb bus</li>
<li>The LSP Enhancer helps with the noise floor and not sounding so distant</li>
<li>Output the electronics at the bottom of the strip to a separate bus</li>
<li>Use the <b>LSP Compressor</b> with a sidechain to duck the electronics when the bassoon plays. Use the pin in out button to set that up.</li>
<li>Group tracks to try and cut in the same places</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org1f96909" class="outline-2">
<h2 id="org1f96909">Workflow B: Hardware Processing (Pedals)</h2>
<div class="outline-text-2" id="text-org1f96909">
<ul class="org-ul">
<li><b>OS</b>: Linux (Gentoo)</li>
<li><b>Logic</b>: Physical Pedals -&gt; Interface -&gt; <b>Ardour</b>.</li>
<li><b>Advantage</b>: Stays in the native mastering environment. No file transfer needed.</li>
</ul>
</div>
</div>
<div id="outline-container-org922e33c" class="outline-2">
<h2 id="org922e33c">Visuals: projectM Preset Development</h2>
<div class="outline-text-2" id="text-org922e33c">
<ul class="org-ul">
<li><b>Status</b>: Struggling with preset creation.</li>
</ul>
</div>
</div>
<div id="outline-container-orgd531f32" class="outline-2">
<h2 id="orgd531f32">Breadcrumbs (Handover)</h2>
<div class="outline-text-2" id="text-orgd531f32">
<ul class="org-ul">
<li><b>Last Action</b>: Chronomancer first recording done.</li>
<li><b>Stuck Point</b>: projectM preset isn't showing image. May need to give up on a custom preset.</li>
<li><b>Next Step</b>: Redo mixing process that was lost. Add sidechain, redirect tracks, tweak eq, cut and rearrange takes, location markers for those takes, remove redundant max takes</li>
<li><b>Next Recording</b>: See if there's a way to lower the latency in VBMatrix</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p><a href="sitemap.html">Site Map</a></p>
</div>
</body>
</html>
